{
  "products": [
    {
      "id": "1",
      "name": "Beats Solo Wireless Headphones",
      "rating": 4.32,
      "category": "tech",
      "description": "With up to 40 hours of battery life, Beats Solo Wireless is your perfect everyday headphone",
      "price": {
        "original": 199.95,
        "current": 99.98
      },
      "features": [
        "High-performance wireless noise cancelling headphones in red",
        "Active Noise Cancelling (ANC) blocks external noise",
        "Transparency helps you stay aware of your surroundings while listening",
        "Features the Apple H1 Headphone Chip and Class 1 Bluetooth for extended range and fewer dropouts",
        "Compatible with iOS and Android",
        "Hands-free controls via “Hey Siri” on iOS devices, and voice capability with the push of the b button on a variety of compatible devices ",
        "Up to 22 hours of listening time (up to 40 hours with ANC and Transparency turned off)"
      ],
      "colors": [
        {
          "color": "red",
          "image": "/assets/images/beats-solo-red.png"
        },
        {
          "color": "black",
          "image": "/assets/images/beats-solo-black.png"
        }
      ]
    },
    {
      "id": "2",
      "name": "Nike Air Force 1",
      "rating": 4.51,
      "category": "sneaker",
      "description": "Debuting in 1982, the AF1 was the first basketball shoe to house Nike Air, revolutionizing the game while rapidly gaining traction around the world.",
      "price": {
        "original": 109.95,
        "current": 89.98
      },
      "features": [
        "Full-grain leather in the upper adds a premium look and feel.",
        "Originally designed for performance hoops, Nike Air cushioning adds lightweight, all-day comfort.",
        "The padded, low-cut collar looks sleek and feels great."
      ],
      "colors": [
        {
          "color": "white",
          "image": "/assets/images/nike-af1-white.png"
        }
      ]
    },
    {
      "id": "3",
      "name": "Playstation 5 Slim",
      "rating": 4.81,
      "category": "gaming",
      "description": "Take your gaming to the next level with PlayStation 5 slim console, with powerful features, like ray tracing, near-instant load times, and HDR technology.",
      "price": {
        "original": 649.95,
        "current": 519.98
      },
      "features": [
        "Ray tracing technology adds more detail and realism to every scene with true-to-life shadows and reflections",
        "1TB internal SSD provides ultrafast data handling speeds that significantly reduce loading times for the installed PS5 games",
        "Supports HDR technology for vibrant and natural looking colours on supported PS5 games",
        "Immersive gaming experience with adaptive triggers, realistic haptic feedback, and Tempest 3D Audio technology"
      ],
      "colors": [
        {
          "color": "white",
          "image": "/assets/images/ps5-slim.png"
        }
      ]
    }
  ]
}
